package Structures.CustomArrayList;

public class CustomArrayList {
//    CustomArrayList - динамический массив, значит он изменяет свою размер, когда не хватает кол-ва элементов

//    0. Конструтор без параметров, который инициализурует массив с некой N
//    0.1 Конструктор принимает размерность N и инициализирует массив

    // 1. add - добавляет элемент в конец массива, если массив недосточной длины, то он увеличивается в 2
    // 1.1 add(el, index) - добавляет элемент по индексу в массив
    // 2. get - получить элемент массива по индекссу
//    3. size - получить размер массива
//    4. remove - удалить элемент массива по индексу
}
